# GetVisionMapping

## Description
Gets the mapping of the lighting device fields from Vectorworks to a visualizer.

```pascal
PROCEDURE GetVisionMapping(
				VAR color     : STRING;
				VAR universe  : STRING;
				VAR gobo      : STRING;
				VAR name      : STRING;
				VAR channel   : STRING;
				VAR fixtureid : STRING);
```

```python

def vs.GetVisionMapping():
    return (color, universe, gobo, name, channel, fixtureid)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|color|STRING||
|universe|STRING||
|gobo|STRING||
|name|STRING||
|channel|STRING||
|fixtureid|STRING||

## Version
Availability: from Vectorworks 2018.3
## Category
* Spotlight